app/views/posts/show.html.erb

	<div class="container">
		<h2 class="subtitle is -5" id="ad"><strong style="color: white;"><%= @post.comments.count %></strong> Comments</h2>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 16]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 16]]