app/controllers/posts_controller.rb

	def index
		@posts = Post.all.order("created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

	def create
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["content", "hjgfyjh"], ["created_at", "2019-03-16 19:50:19.221368"], ["updated_at", "2019-03-16 19:50:19.221368"]]

	def update
		@post = Post.find(params[:id])
		if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "It's a biggest truth ever told."], ["updated_at", "2019-03-16 22:38:12.345950"], ["id", 5]]

	def find_post
		@post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]